import java.util.List;

public class Main {
    public static void main(String[] args) {
        Order order = new Order(11, 80, "Tashkent Chilonzar");

        DeliveryService deliveryService = new DeliveryServiceImpl(order);
        System.out.println(deliveryService.send(order));

/*Бизнес-контекст
Ваш интернет-магазин оформляет отправку товаров через собственный внутренний
интерфейс доставки. Модуль оформления заказов умеет работать только с этим интерфейсом
— он передает в него ваш внутренний объект заказа (содержащий идентификатор заказа, вес в килограммах и адрес доставки строкой) и ждет в ответ строку с трек-номером.
Компания подписывает договор с новой курьерской службой «Быстрая Доставка»
и подключает их стороннюю библиотеку Код этой библиотеки менять нельзя.

Проблема интеграции
Интерфейсы вашей системы и сторонней библиотеки не совпадают по нескольким параметрам:
1 Единицы измерения: Ваша система оперирует весом в килограммах (дробное число),
 а внешняя библиотека принимает вес строго в граммах (целое число).
2 Типы данных адреса: Ваш объект заказа хранит адрес простой строкой,
а внешняя служба требует передавать специальный объект адреса из их SDK.
3 Имена и сигнатуры методов: Метод отправки во внешней
 библиотеке называется иначе и принимает другие аргументы, чем ваш внутренний интерфейс.*/
    }
}
